tests/regression_tests/expression_bdd_dot/deep_all_ops.dot
digraph bdd {
  rankdir=TB;
  "node000" [label = "alpha", name = "node000", rank = "0", shape = "circle", style = "filled"];
  "node001" [label = "beta", name = "node001", rank = "1", shape = "circle", style = "filled"];
  "node002" [label = "beta", name = "node002", rank = "1", shape = "circle", style = "filled"];
  "node003" [label = "gamma", name = "node003", rank = "2", shape = "circle", style = "filled"];
  "node004" [label = "gamma", name = "node004", rank = "2", shape = "circle", style = "filled"];
  "node005" [label = "delta", name = "node005", rank = "3", shape = "circle", style = "filled"];
  "node006" [label = "delta", name = "node006", rank = "3", shape = "circle", style = "filled"];
  "node007" [label = "zeta", name = "node007", rank = "2", shape = "circle", style = "filled"];
  "node008" [label = "eta", name = "node008", rank = "3", shape = "circle", style = "filled"];
  "node009" [label = "theta", name = "node009", rank = "4", shape = "circle", style = "filled"];
  "node010" [label = "iota", name = "node010", rank = "2", shape = "circle", style = "filled"];
  "node011" [label = "iota", name = "node011", rank = "3", shape = "circle", style = "filled"];
  "node012" [label = "kappa", name = "node012", rank = "3", shape = "circle", style = "filled"];
  "node013" [label = "kappa", name = "node013", rank = "4", shape = "circle", style = "filled"];
  "node014" [label = "0", fillcolor = "lightgray", name = "node014", rank = "3", shape = "box", style = "filled"];
  "node015" [label = "1", fillcolor = "lightgray", name = "node015", rank = "4", shape = "box", style = "filled"];
  "node000" -> "node001" [style = "dashed"];
  "node000" -> "node002" [style = "solid"];
  "node001" -> "node003" [style = "solid"];
  "node001" -> "node007" [style = "dashed"];
  "node002" -> "node004" [style = "solid"];
  "node002" -> "node010" [style = "dashed"];
  "node003" -> "node005" [style = "dashed"];
  "node003" -> "node010" [style = "solid"];
  "node004" -> "node006" [style = "dashed"];
  "node004" -> "node007" [style = "solid"];
  "node005" -> "node007" [style = "solid"];
  "node005" -> "node010" [style = "dashed"];
  "node006" -> "node007" [style = "dashed"];
  "node006" -> "node010" [style = "solid"];
  "node007" -> "node008" [style = "dashed"];
  "node007" -> "node011" [style = "solid"];
  "node008" -> "node009" [style = "solid"];
  "node008" -> "node010" [style = "dashed"];
  "node009" -> "node010" [style = "dashed"];
  "node009" -> "node011" [style = "solid"];
  "node010" -> "node012" [style = "solid"];
  "node010" -> "node014" [style = "dashed"];
  "node011" -> "node013" [style = "solid"];
  "node011" -> "node015" [style = "dashed"];
  "node012" -> "node014" [style = "solid"];
  "node012" -> "node015" [style = "dashed"];
  "node013" -> "node014" [style = "dashed"];
  "node013" -> "node015" [style = "solid"];
}
